In [10]:
import pandas as pd
import os
from sqlalchemy import create_engine
import time
import datetime

In [11]:
thor_data = 'THOR_WWII_DATA_CLEAN.csv'

In [12]:
thor_df = pd.read_csv(thor_data, encoding='latin-1')

In [15]:
thor_df = thor_df[['MSNDATE', 'THEATER','NAF','COUNTRY_FLYING_MISSION','TGT_COUNTRY','TGT_LOCATION','LATITUDE','LONGITUDE']].copy()
thor_df
thor_df = thor_df.sort_values(by='MSNDATE').copy()

In [16]:
thor_df = thor_df.dropna(how='any').copy()
thor_df

,MSNDATE,THEATER,NAF,COUNTRY_FLYING_MISSION,TGT_COUNTRY,TGT_LOCATION,LATITUDE,LONGITUDE
6799,1/1/41,ETO,RAF,GREAT BRITAIN,GERMANY,BREMEN,53.08,8.72
6809,1/1/41,ETO,RAF,GREAT BRITAIN,GERMANY,BREMEN,53.08,8.72
6810,1/1/41,ETO,RAF,GREAT BRITAIN,GERMANY,BREMEN,53.08,8.72
6811,1/1/41,ETO,RAF,GREAT BRITAIN,GERMANY,BREMEN,53.08,8.72
6812,1/1/41,ETO,RAF,GREAT BRITAIN,GERMANY,BREMEN,53.08,8.72
...,...,...,...,...,...,...,...,...
99267,9/9/44,ETO,RAF,GREAT BRITAIN,GERMANY,EMDEN,53.38,7.22
99250,9/9/44,ETO,RAF,GREAT BRITAIN,GREAT BRITAIN,MUNCHEN GLADBACH,51.20,6.42
99251,9/9/44,ETO,RAF,GREAT BRITAIN,GERMANY,MUNCHEN GLADBACH,51.20,6.42
99252,9/9/44,ETO,RAF,GREAT BRITAIN,GERMANY,MUNCHEN GLADBACH,51.20,6.42
99253,9/9/44,ETO,RAF,GREAT BRITAIN,GERMANY,MUNCHEN GLADBACH,51.20,6.42

In [ ]:
engine = create_engine('sqlite://', echo=False)